import React from "react";
import { useParams } from "react-router-dom";
function TheAchievementCard() {
  const { cardId } = useParams();
  let cardText = "";
  let cardText2 = "";
  let cardTextMain = "";
  if (cardId === "1") {
    cardTextMain = `Жаңа Жоғарғы Кеңес қабылдаған ең маңызды құқықтық акт 1990 жылы 25 қазанда қабылданған «Мемлекеттік егемендік туралы декларация» болды.`;
    cardText2 = ` Ол Қазақстанның өз аумағында оның егемендік құқықтары мен Конституциясын бұзатын заңдар мен Одақтың жоғары органдарының басқа да актілерін тоқтата тұру құқығын жариялады. Республиканың барлық табиғи ресурстарға, экономикалық және ғылыми-техникалық әлеуетке айрықша меншiк құқығын жариялауы Қазақстанның дербес экономикалық саясат жүргiзуге мүмкiндiк туғызды. Декларация тұңғыш рет мемлекеттің әлеуметтік негізін анықтаудағы таптық көзқарастан бас тартып, мемлекеттіліктің жалпыхалықтық сипатын жариялады. Сонымен қатар, құжатта биліктің бөліну қағидасын және Қазақстанның халықаралық-құқықтық субъектісін іске асыру қажеттілігін күшейтетін ережелер қамтылды. Территорияның бөлінбейтіндігі мен қол сұғылмауы сияқты қағидалар нақты жазылып, азаматтық институт енгізіліп, әртүрлі меншік нысандарының теңдігі жарияланды                             `;
    cardText = `
    90-жылдардың басында қоғамда болып жатқан саяси үдерістер таңқаларлық қарқынға ие болды. Қайта құру және жариялылық ұрандарының толқынында 1990 жылы наурызда Қазақ КСР Жоғарғы Кеңесіне сайлау өтті. Бұл жоғарғы заң шығарушы органға алғашқы демократиялық сайлау болатын. Халықтың әртүрлі топтарының өкілдері: жұмысшылар, әскери қызметкерлер, ғылыми мекемелерден ұсынылғандар сайланды. Депутаттардың саяси құмарлықтары да әртүрлі болды. Олардың кейбіреулері ескі кеңестік дәстүрлерді ұстанса да, сонымен қатар халық қалаулыларының көпшілігі қарқынды өзгерістерді қалады және талап етті. Дәл осы депутаттар корпусы Тәуелсіздіктің қалыптасуына негіз болған маңызды актілердің тұтас пакетін қабылдады.
    
    `;
  } else if (cardId === "2") {
    cardText2 = `Конституциялық заң болды. Мемлекеттік егемендік туралы декларацияның Басты идеяларын дамыта отырып, Конституциялық Заң Қазақстан Республикасының бұдан былай барлық мемлекеттермен өзара қарым-қатынастарын халықаралық құқық қағидаттарына негіздейтінін, сондай-ақ тәуелсіз мемлекетке лайық екенін біржақты бекітті. Алғаш рет Бірыңғай Қазақстан азаматтығы құрылды. Декларацияда жарияланған меншік нысандарының алуан түрлілігі, мемлекеттік билікті заң шығарушы, атқарушы және сот билігіне бөлу принципі заңдастырылды, мемлекеттің қаржылық - несиелік, салықтық және кедендік саясатымен тәуелсіз экономикалық жүйеге бағыты бекітілді
    `;
    cardTextMain = ` "Қазақстан Республикасының мемлекеттік тәуелсіздігі туралы"`;
    cardText = `
   
1991 жылдың желтоқсан айының басында үш республиканың басшылары: Ресей-Б. Ельцин, Украина Л. Кравчук және Беларусь-С.Шушкевич 1922 жылғы Одақ шартының күшін жою туралы Беловеж келісіміне қол қойды.
1991 жылғы 10 желтоқсанда Жоғарғы Кеңес Қазақ КСР-ін Қазақстан Республикасы деп қайта атау туралы шешім қабылдады, ал 1991 жылғы 16 желтоқсанда Жоғарғы кеңес Қазақстан Республикасының мемлекеттік тәуелсіздігін жариялады. Республика тарихындағы жаңа кезең басталды.
Қазақ КСР мен КСРО Одағына құқықтық мирасқор жаңа мемлекеттің туу процесі басталды.
Бұл процестің ерекше кезеңі 1991 жылғы 16 желтоқсандағы  `;
  } else if (cardId === "3") {
    cardTextMain = `ҚР Конституциясы – мемлекеттің құқықтық жүйесінің ядросы, ағымдағы (салалық) заңнаманы дамытудың негізі болып табылады.`;
    cardText2 = `1995 жылғы Конституцияда мемлекеттік билік пен мемлекеттің әлеуметтік базасының қайнар көзі ретінде адам мен азаматтың, бүкіл халықтың конституциялық мәртебесі бекітілді. Конституция мемлекетті әлеуметтік деп таниды, бұл мемлекет әлеуметтік саясатты халықты тиімді қорғау және бүкіл халықтың өмір сүруіне жағдай жасау ретінде қарастыратынын білдіреді.`;
    cardText = `
    1995 жылғы 30 тамыздағы республикалық референдумда қабылданған ҚР Конституциясы еліміздің Басты Заңы болып табылады. Ол конституциялық құрылыс пен оның негіздерін, адам мен азаматтың құқығы мен бостандығын, мемлекеттік ұйымдастыру негіздерін, сондай-ақ билікті жүзеге асыруды ұйымдастырудың негіздерін бекітуге шақырады. Қазақстан Республикасының Конституциясы басқа құқықтық актілерге қатысты жоғарғы заң күшіне ие: елімізде қабылданатын бір де бір құқықтық акті (конституциялық заң, ҚР Президентінің Жарлығы, өңірілк құқықтық шығармашылық актісі, сот шешімі және т.б.) Басты Заңға қайшы келе алмайды, ал қайшы келген жағдайда (заңды коллизия) Конституция нормалары басымдылыққа ие болады. 
`;
  } else if (cardId === "4") {
    cardTextMain = `«Мәдени мұра» `;
    cardText2 = `мемлекеттік бағдарламасын жүзеге асыруды тапсырған болатын. Елбасының жолдауымен қабылданған «Мәдени мұра» мемлекеттік бағдарламасы қазіргі Қазақстанның әлемдік өркендеуінің дәлелі`;
    cardText = `
    Мәдени мұра» мемлекеттік бағдарламасы – мәдени, экономикалық және әлеуметтік капитал, жалпы адамзаттық мәдениеттің құрылымдық бөлігі, этнос, қоғам, адам парасатының дамуы мен құрылуының бастауы, тарихи естеліктердің маңызды қоймасын жасау және қорғау бағдарламасы. Ежелгі тарихтың негіздерін бүгінгі күнмен қосатын жолды құрап, уақыттың үзіліссіз байланысын көрсететін қазіргі дау-дамайдағы адамзатқа қажетті көп қырлы қоғамның тарихи тәжірибесін зерттейді.
Тарихи-мәдени мұрамен хабардар етіп, тек тарихты ғана емес, сонымен қатар болашақта болатын жағдайды баяндайды. Сондықтан да, Елбасымыз осыдан 15 жыл бұрын, яғни 2003 жылы сәуірде Қазақстан халқына жолдауында арнайы 
`;
  } else if (cardId === "5") {
    cardTextMain = ` Съезд аясында "бейбітшіліктің рухани негіздері және соғыстардың алдын алу туралы Декларация" қабылданды. `;
    cardText2 = `Бұл құжат қатысушылардың бейбітшілікті, әділеттілікті және діндер арасындағы диалогты нығайтуға міндеттемесін білдірді.
    Конгресс мәдени дәстүрлердің байлығы мен алуан түрлілігін көрсету үшін әртүрлі мәдени іс-шараларды, көрмелер мен концерттерді қамтыды.
   Астанадағы Әлемдік көшбасшылар мен дәстүрлі діндер көшбасшыларының бірінші съезі дінаралық диалог пен бейбітшілікті ілгерілетудегі маңыздылығы үшін танылды. Бұл іс-шара дәстүрге айналды және үш жылда бір рет өткізіліп, әлемнің түкпір-түкпірінен діни көшбасшылар мен өкілдерді тартады.
   Астанадағы Әлемдік көшбасшылар мен дәстүрлі діндер көшбасшыларының съезі түрлі діндер арасындағы ынтымақтастықтың маңыздылығын және әлемдік аренада бейбітшілікке, толеранттылыққа және түсіністікке ұмтылуды атап өтті. Қазақстан әлемдік діни көшбасшылар кездесіп, ортақ мәселелер мен сын-қатерлерді талқылай алатын орынға айналды.
   `;
    cardText = `Әлемдік көшбасшылар мен дәстүрлі діндер көшбасшыларының бірінші съезі
    Әлемдік көшбасшылар мен дәстүрлі діндер көшбасшыларының бірінші съезі 2003 жылғы 23-24 қыркүйек аралығында Қазақстан астанасында, Астанада өтті. Бұл іс-шара Қазақстан Президенті Нұрсұлтан Назарбаевтың бастамасымен ұйымдастырылды және бейбітшіліктің, Толеранттылықтың және діндер арасындағы диалогтың маңызды мәселелерін талқылау үшін әлемдік діни көшбасшыларды жинау әрекетін білдірді.
    Конвенцияға 40-тан астам елден 100-ден астам діни лидерлер мен өкілдер, соның ішінде христиандық, ислам, буддизм, иудаизм, ислам және басқалар қатысты.
    Съездің басты тақырыбы терроризм, ксенофобия және діни төзімсіздік қаупі аясында әртүрлі діндер мен мәдениеттер арасындағы диалог пен түсіністікті нығайту қажеттілігі болды. Қатысушылар бейбітшілік, адамгершілік, жастар және діни білім мәселелерін талқылады.
    
`;
  } else if (cardId === "7") {
    cardTextMain = `800-ден астам спортшыны жинады `;
    cardText2 = `Жарысқа шаңғы жарысы, биатлон, мәнерлеп сырғанау, конькимен сырғанау, хоккей және т.б. сияқты спорт түрлері кірді.
    Азия қысқы ойындарына қатысушыларды орналастыру үшін Алматыда арнайы олимпиадалық ауыл салынды.
    Қазақстан өзінің спорттық инфрақұрылымын дамытуға, жаңа нысандар салуға және іс-шараға дайындық үшін қолданыстағыларын жаңартуға қаражат салды.
   2011 жылғы азиялық қысқы ойындардың мақсаттарының бірі спорт арқылы Азия елдері арасындағы ынтымақтастық пен достықты нығайту, сондай-ақ аймақта қысқы спорт түрлерін насихаттау болды.
    Әр түрлі елдердің спортшылары әртүрлі пәндер бойынша медальдар үшін бақ сынасты. Қазақстан медальдық есепте жетекші орынға ие болды және бірқатар спорт түрлерінде әсерлі нәтижелер көрсетті.
   
   2011 жылғы Азия қысқы ойындары Қазақстан үшін маңызды оқиға болды, оның халықаралық спорттық іс-шараларды ұйымдастыру және өткізу қабілетін көрсетті. Олар сондай-ақ Азия аймағында қысқы спорт пен спорттық мәдениетті насихаттауға ықпал етті.
   `;
    cardText = `
    2011 жылғы Азия қысқы ойындары, сондай-ақ 7-ші Азия қысқы ойындары ретінде белгілі, 2011 жылдың 30 қаңтары мен 6 ақпаны аралығында Қазақстанда өткен халықаралық спорттық іс-шара болды. Бұл ойындар Азия аймағындағы қысқы спорт саласындағы ең ірі іс-шараға айналды және әртүрлі Азия елдерінен спортшыларды жинады.
    Ойындар Қазақстанның бірнеше қаласында, соның ішінде Алматы, Астана, Тараз және Шымкент қалаларында өтті. Бұл Қазақстанның спорттық инфрақұрылымы үшін маңызды оқиға болды.
    Ойындар 25 Азия елінен`;
  } else if (cardId === "8") {
    cardTextMain = ` Қазақстан алғаш рет ЕҚЫҰ-ға төрағалық еткен Азия елі болды және бұл халықаралық қоғамдастықтың үлкен қызығушылығы мен назарын аударды.`;
    cardText2 = (
      <div className="  text-lg font-montserrat">
        <h1 className="font-semibold">
          Қазақстан алғаш рет ЕҚЫҰ-ға төрағалық еткен Азия елі болды және бұл
          халықаралық қоғамдастықтың үлкен қызығушылығы мен назарын аударды.
        </h1>
        1. Трансұлттық қауіп-қатерлерге қарсы күрес: Қазақстан өңірдегі
        терроризмге, трансұлттық қылмысқа және есірткінің таралуына қарсы
        күреске баса назар аударды. Ол осы қауіптермен күресу үшін халықаралық
        ынтымақтастықты күшейтуге шақырды.
        <br />
        2. Диалогты дамыту және оған жәрдемдесу: Қазақстан ЕҚЫҰ-ға қатысушы
        елдер арасындағы саяси диалогты күшейтуге белсенді түрде жәрдемдесті..
        <br />
        3. Адам құқықтарын ілгерілету: Қазақстан өзінің төрағалығында адам
        құқықтарын сақтаудың маңыздылығын атап өтті. Ол бұқаралық ақпарат
        құралдарының бостандығы, жиналу бостандығы және азшылық құқықтарына
        назар аударды.
        <br />
        4. Экономикалық ынтымақтастық: Қазақстан ЕҚЫҰ аясындағы экономикалық
        ынтымақтастық пен даму мәселелерін де көтерді.
        <p>
          Қазақстанның 2010 жылы ЕҚЫҰ-ға төрағалығы сындарлы және оң деп
          бағаланды және бұл елге өзінің халықаралық беделін нығайтуға мүмкіндік
          берді. Қазақстан ЕҚЫҰ қызметіне белсенді қатысуды жалғастырды және
          өзінің төрағалығы аяқталғаннан кейін өңірдегі қауіпсіздік пен
          ынтымақтастыққа байланысты бірқатар маңызды мәселелер бойынша жұмысты
          жалғастыра отырып.
        </p>
      </div>
    );
    cardText = `Қазақстанның Еуропадағы қауіпсіздік және Ынтымақтастық Ұйымына (ЕҚЫҰ) 2010 жылы төрағалық етуі осы ел үшін және жалпы өңір үшін маңызды оқиға болды. Бұл Қазақстанның ЕҚЫҰ-ға алғашқы төрағалығы болды және ол 2010 жылдың 1 қаңтары мен 31 желтоқсаны аралығында жалғасты. 
    Қазақстан өзінің төрағалығы кезінде бірнеше Басты бағыттарға назар аударды:
    
   `;
  } else if (cardId === "9") {
    cardTextMain = `Көрмеге 100-ден астам елдер мен халықаралық ұйымдар қатысып, тұрақты энергетика саласындағы өз инновациялары мен әзірлемелерін ұсынды. `;
    cardText2 = `
    Павильондар мен көрме нысандары: іс-шара аясында энергия мен инновация тақырыбын бейнелейтін түрлі павильондар мен сәулет нысандары салынды. Мысалы," Астана сферасы " - көрменің символына айналған алып шар.
    
    Астанадағы Экспо 2017 әлемге тұрақты энергетика мәселелеріне назар аударуға және осы саладағы түрлі елдер арасындағы диалог пен ынтымақтастықты ынталандыруға мүмкіндік берген маңызды іс-шара болды. Қазақстан бұл оқиғаны инновациялар мен тұрақты технологияларды дамытудағы өз әлеуетін көрсету үшін де пайдаланды.
    `;
    cardText = `"ЭКСПО 2017" халықаралық көрмесі Қазақстанның астанасы Астана қаласында 2017 жылдың 10 маусымы мен 10 қыркүйегі аралығында өтті. Бұл көрме "Болашақ энергиясы" ұранымен ұйымдастырылып, тұрақты энергетика мен инновация мәселелеріне арналды.

    Іс-шараның Басты тақырыбы баламалы энергия көздері, энергия үнемдеу және тұрақты энергетика мәселелері болды. Осыған байланысты іс-шара әлемнің түкпір-түкпірінен экологтардың, инженерлердің, ғалымдардың және бизнес өкілдерінің назарын аударды.
    
    Қатысушылар: "ЭКСПО 2017" әр түрлі елдерден көптеген қатысушыларды тартты.  `;
  }
  return (
    <div className=" px-4 flex flex-col mx-auto max-w-screen-xl   font-montserrat  ">
      {/* карточки */}
      <div>
        <div className="flex flex-col w-full ">
          <span className="mt-4 text-[#333]  text-lg font-semibold">
            {cardText}
          </span>
          <div className="flex-col p-4 ">
            <svg
              xmlns="http://www.w3.org/2000/svg"
              width="65"
              height="45"
              viewBox="0 0 65 45"
              fill="none"
              className="mb-2"
            >
              <path
                d="M51.56 44.043C57.9106 43.2799 62.7408 38.5683 63.463 32.4505C63.7812 29.782 63.0383 26.5085 61.6305 24.3192C59.5063 21.0237 56.3844 19.1622 52.3266 18.7697C49.3295 18.4694 48.478 17.8759 48.933 16.3958C49.2896 15.2419 51.6304 12.5133 53.516 11.0668C55.4632 9.56199 58.4831 7.70666 60.6897 6.65602C63.4634 5.33689 64.4487 3.87954 63.8427 1.9925C63.6077 1.23535 62.8424 0.478673 62.0281 0.176457C61.2016 -0.125748 59.4011 -0.0192688 57.9955 0.413105C56.479 0.880533 54.4573 1.77953 52.6946 2.78316C45.9274 6.62264 40.9738 11.3344 37.5876 17.1516C36.2454 19.4599 35.2241 22.0941 34.6837 24.6114C34.303 26.4061 34.2815 29.9482 34.6405 31.4859C36.3987 39.1512 42.4956 44.2725 49.7102 44.1612C50.2528 44.149 51.079 44.09 51.56 44.043Z"
                fill="#2C4FA4"
              />
              <path
                d="M17.0906 44.0855C20.2228 43.6749 22.8979 42.4374 25.0419 40.4081C29.6751 36.0346 30.3716 28.7516 26.6547 23.5116C25.8891 22.4287 24.0624 20.7991 22.9396 20.2059C21.7798 19.5777 20.2871 19.1013 19.0043 18.9277C18.4863 18.8583 17.6475 18.7425 17.1419 18.6847C15.7728 18.4995 15.3286 18.3484 14.8843 17.9294C14.5757 17.6383 14.4769 17.4403 14.4766 17.1258C14.476 16.45 14.9191 15.5407 15.7938 14.433C17.9126 11.7512 21.1416 9.34807 26.1464 6.74525C28.6488 5.44966 29.5235 4.48178 29.5222 3.01367C29.5213 2.04657 29.2371 1.41763 28.5213 0.812384C27.8178 0.218775 27.2503 0.0328559 26.128 0.0338614C23.5752 0.0361487 19.7042 1.69416 15.0945 4.7627C6.79949 10.2698 1.1337 18.3728 0.104722 26.1571C-0.0422791 27.2641 0.0341802 30.0139 0.244817 31.1089C0.60418 33.0195 1.53131 35.4539 2.49468 37.026C4.10023 39.5879 6.84023 41.9741 9.45575 43.067C11.1706 43.7762 12.6755 44.0895 14.6241 44.146C15.5368 44.1685 16.6467 44.1442 17.0906 44.0855Z"
                fill="#2C4FA4"
              />
            </svg>
            <span className="text-[#2C4FA4] font-bold text-xl  ">
              {cardTextMain}
            </span>
          </div>
          <span className="mt-4 text-[#333]   text-lg font-semibold">
            {cardText2}
          </span>
        </div>
      </div>
    </div>
  );
}

export default TheAchievementCard;
